app/controllers/front_controller.rb

  def index
    @notes = Note.paginate(:page=>params[:page], :per_page => 4, :conditions => 'is_active = 1', :order => 'created_at DESC')
---
SELECT * FROM "notes" WHERE (is_active = 1) ORDER BY created_at DESC LIMIT 4 OFFSET 0

  def exhibition_list
    @exhibitions = Exhibition.find(:all, :conditions => 'is_active = 1', :order => "event_start_at DESC")
    @exhibitions_future = Exhibition.all_future_shows
    @exhibitions_past = Exhibition.all_past_shows
    @exhibitions_current = Exhibition.all_current_shows
    @exhibitions_current_count = Exhibition.count(:all, :conditions => ['is_active = 1 and event_start_at < ? and event_finish_at > ?',Time.now, Time.now])
---
SELECT * FROM "exhibitions" WHERE (is_active = 1 and event_start_at < '2010-01-07 14:03:24' and event_finish_at > '2010-01-07 14:03:24') ORDER BY event_start_at desc
SELECT count(*) AS count_all FROM "exhibitions" WHERE (is_active = 1 and event_start_at < '2010-01-07 14:03:24' and event_finish_at > '2010-01-07 14:03:24')

  def product_list
    @products = Product.find(:all, :conditions => 'is_active = 1', :order => "id DESC")
---
SELECT * FROM "products" WHERE (is_active = 1) ORDER BY id DESC