app/controllers/presses_controller.rb

SELECT * FROM "presses" WHERE ("presses"."id" = 1)
---
  def show
    @press = Press.find(params[:id])

INSERT INTO "presses" ("name", "created_at", "image_file_name", "image_file_size", "updated_at", "image_content_type", "image_updated_at") VALUES('test', '2010-01-08 19:33:24', 'vandercook_universal_iii.jpg', 12151, '2010-01-08 19:33:24', 'image/jpeg', '2010-01-08 19:33:22')
---
  def create
    @press = Press.new(params[:press])

    respond_to do |format|
      if @press.save