app/controllers/reservations_controller.rb

  def index

    @date = params[:date] ? Date.parse(params[:date]) : Date.today
    @holiday = Holiday.find_by_date(@date)
    day_of_the_week = @date.wday + 1
    @studio_hours = WorkDay.find_by_day_number(day_of_the_week)
    @presses = Press.find :all, :include => [:reservations]
---
SELECT * FROM "reservations"

  def show
    @reservation = Reservation.find(params[:id])
---
SELECT * FROM "reservations" WHERE ("reservations"."id" = 0)