app/controllers/users_controller.rb

SELECT * FROM "users" LIMIT 1
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "role", "password_salt", "phone_number", "persistence_token", "last_name", "email", "first_name") VALUES('2010-01-08 20:02:29', '366b3d45171cf9dfc73835f378a8db874beffb8b9cb1093c80011ad8cc71b47f43bce3ab7b297cdd35c598d2506c930441da99d00eb7219971bcb60ee167a3c7', '2010-01-08 20:02:29', 'administrator', 'qQc2Dt9QO-dH7iFBs9CV', '(555) 555-1212', '1cb4109b634bd402fee70bb9b29666f53c915d26da3dc034fb8cfb7a4a0b8cf644c241ba6e6e1aba2a5ea1e6c6d6fc99e8ebae033e0fc7bd4634b661c908ad91', 'Parsons', 'jparsons@klondikefive.com', 'John')
---
  def create
    @user = User.new(params[:user])
    if User.all.blank?
      @user.role = "administrator"
    else
      @user.role = "unconfirmed"
    end
    if @user.save